ESP6109/ESP32Toy/32LCD/src/main(Pre-Segmentation).cpp
// ESP32_LCD_GPS_Project
// Start at 2024.11.21 16:19:16
// Build Version 3.5.0
// Building
// Release at 2025.09.19 23:00
#include <Arduino.h>
#include <u8g2lib.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include "esp32-hal-cpu.h"
#include "esp_system.h"
#include "esp_sleep.h"
#include <driver/gpio.h>
#include <Ticker.h>
#include <TinyGPS++.h>
#include <TinyGPSPlus.h>
#include <HardwareSerial.h>

// LCD12232接口
/////////////////////////////////////////
#define E 5
#define RW 18
#define RS 19
U8G2_ST7920_128X32_F_SW_SPI u8g2(U8G2_R0, E, RW, RS, U8X8_PIN_NONE);
// U8G2_ST7920_128X32_F_SW_SPI u8g2(U8G2_R0, 5, 18, 19, U8X8_PIN_NONE);
/////////////////////////////////////////

// 摇杆按键接口
/////////////////////////////////////////
#define BU 0
//(0,0)
//              (4095,4095)
// GND
// 5V(3.3V)
#define X 26
#define Y 14
#define SW 13
struct Key
{
  const uint8_t Pin;
  bool pressed;
};
Key Button = {BU, 0};
Key Switch = {SW, 0};
unsigned long ST1 = 0, ST2 = 0;
unsigned long BT1 = 0, BT2 = 0;
/////////////////////////////////////////

// GPS接口
/////////////////////////////////////////
// Serial2
#define TX 17
#define RX 16
/////////////////////////////////////////

// 蜂鸣器接口
/////////////////////////////////////////
#define Beep 33
/////////////////////////////////////////

// 主界面图标
/////////////////////////////////////////
int menuicons[2][5] =
    {{184, 93, 124, 129, 209},
     {240, 92, 240, 141, 235}};
/////////////////////////////////////////

// 设置图标
/////////////////////////////////////////
int settingsicons[1][5] = {247, 94, 123, 188, 65};
/////////////////////////////////////////

// 天气图标
/////////////////////////////////////////
int weathericons[4] = {259, 127, 124, 241}; // 晴 阴 云 雨
/////////////////////////////////////////

// 电源图标
/////////////////////////////////////////
int powericons[1][5] = {235, 243, 223, 240, 65};
/////////////////////////////////////////

// 日期与时间
/////////////////////////////////////////
int Yea = 1970, Mon = 1, Day = 1; // 年月日
int Hou = 8, Min = 0, Sec = 0;    // 时分秒
int Wee = 1;                      // 星期
Ticker esp_timer;                 // 时钟计时
int timer1, timer2;               // 摇杆计时
bool G_t = 0;                     // 接入卫星时间
bool reset = 0;                   // 定时器重置
bool r = 1;                       // 蜂鸣器
/////////////////////////////////////////

// 温湿度
/////////////////////////////////////////
int Tem = 0, Hum = 0;
int MaxT = 0, MinT = 0;
/////////////////////////////////////////

// 定位模块
/////////////////////////////////////////
TinyGPSPlus GPS;
TinyGPSCustom A(GPS, "GPRMC", 2);  // 有效值
TinyGPSCustom NS(GPS, "GPRMC", 4); // 南北
TinyGPSCustom WE(GPS, "GPRMC", 6); // 东西
float Lng = 0, Lat = 0;            // 经纬
int Spe = 0;                       // 速度
int Cou = 0;                       // 方向角
char Ava[2];                       // 有效值
/////////////////////////////////////////

// 定义
/////////////////////////////////////////
// int button();
// int joysw();
void IRAM_ATTR button();
void IRAM_ATTR joysw();
void clearscr();
void joystick(int *, int *);
void home();
void menu();
void clccal();
void timer();
void timerset();
int count(int, int, int);
void cpause();
void ring(int);
void weather();
void settings();
void lab();
void gps();
void gpsget();
void gpsdisplay(int);
void clksets();
void esp_info();
void building();
void manager();
void s_box();
void s_shot();
void power();
void restart();
void shutdown();
// void test();
/////////////////////////////////////////

// 日历与时钟
/////////////////////////////////////////
void clccal()
{
  timer();
  if (!G_t)
    Sec = Sec + 1;
  if (Sec > 59)
  {
    Sec = 0;
    Min++;
  }
  if (Min > 59)
  {
    Min = 0;
    Hou++;
  }
  if (Hou >= 24)
  {
    Hou = 0;
    Day++;
  }
  if ((Mon == 1 || Mon == 3 || Mon == 5 || Mon == 7 || Mon == 8 || Mon == 10 || Mon == 12) && (Day > 31))
  {
    Mon++;
    Day %= 31;
  }
  else if ((Mon == 4 || Mon == 6 || Mon == 9 || Mon == 11) && (Day > 30))
  {
    Mon++;
    Day %= 30;
  }
  else if (Mon == 2)
  {
    if ((Yea % 4 == 0 || Yea % 400 == 0) && (Yea % 100 != 0) && Day > 29)
    {
      Mon++;
      Day %= 29;
    }
    else if ((Yea % 4 != 0 || Yea % 100 == 0) && Day > 28)
    {
      Mon++;
      Day %= 28;
    }
  }
  if (Mon > 12)
  {
    Yea++;
    Mon %= 12;
  }
  if (Mon == 1 || Mon == 2)
    Wee = (Day + 2 * (Mon + 12) + 3 * (Mon + 12 + 1) / 5 + (Yea - 1) + (Yea - 1) / 4 - (Yea - 1) / 100 + (Yea - 1) / 400) % 7;
  else
    Wee = (Day + 2 * Mon + 3 * (Mon + 1) / 5 + Yea + Yea / 4 - Yea / 100 + Yea / 400) % 7;
  Wee++;
  /*if (Hou == 17 && Min == 7)
    ring();*/
}
/////////////////////////////////////////

// 计时器
/////////////////////////////////////////
void timer()
{
  ;
  /*analogWrite(33, 0);
  analogWrite(25, 0);*/
}
/////////////////////////////////////////

// 按键IO0
/////////////////////////////////////////
void IRAM_ATTR button()
{
  BT1 = millis();
  if (BT1 - BT2 > 250)
  {
    Button.pressed = 1;
    BT2 = BT1;
  }
}
/////////////////////////////////////////

// 按键SW
/////////////////////////////////////////
void IRAM_ATTR joysw()
{
  ST1 = millis();
  if (ST1 - ST2 > 250)
  {
    Switch.pressed = 1;
    ST2 = ST1;
  }
}
/////////////////////////////////////////

// 初始化
/////////////////////////////////////////
void setup()
{
  u8g2.begin();
  Serial.begin(115200);
  Serial2.begin(9600);
  u8g2.enableUTF8Print();
  // test();
  pinMode(2, OUTPUT);
  pinMode(Beep, OUTPUT);
  pinMode(BU, INPUT);
  pinMode(SW, INPUT_PULLUP); // z_PULLUP
  pinMode(X, INPUT);         // x
  pinMode(Y, INPUT);         // y
  attachInterrupt(digitalPinToInterrupt(BU), button, FALLING);
  attachInterrupt(digitalPinToInterrupt(SW), joysw, FALLING);
  esp_sleep_enable_ext0_wakeup(GPIO_NUM_13, 0);
  setCpuFrequencyMhz(80);
  esp_timer.attach(1.0, clccal);
  timer1 = timer2 = millis();
  // clearscr();
  // manager();
}
/////////////////////////////////////////

// 清屏
/////////////////////////////////////////
void clearscr()
{
  u8g2.clearBuffer();
  u8g2.drawBox(0, 0, 122, 32);
  u8g2.sendBuffer();
  delay(100);
  u8g2.clearBuffer();
  u8g2.sendBuffer();
}
/////////////////////////////////////////

// 摇杆
/////////////////////////////////////////
void joystick(int *C_x, int *C_y)
{
  int VRX = analogRead(X);
  int VRY = analogRead(Y);
  // int VSW = analogRead(SW);//!!!!
  if (millis() - timer1 >= 250)
  {
    if (VRX >= 2870)
      (*C_x)++;
    else if (VRX <= 890)
      (*C_x)--;
    if (VRY >= 2870)
      (*C_y)++;
    else if (VRY <= 890)
      (*C_y)--;
    timer1 = millis();
  }
}
/////////////////////////////////////////

