ESP6109/ESP32Toy/32LCD/src/main(Pre-Segmentation).cpp
// 主循环
/////////////////////////////////////////
void loop()
{
  home();
}
/////////////////////////////////////////

// 主页
/////////////////////////////////////////
void home()
{
  if (/*Button.pressed  ||()*/ Switch.pressed)
  {
    // Serial.println(Button.pressed);
    Button.pressed = 0;
    Switch.pressed = 0;
    menu();
  }
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_helvB12_tf);
  u8g2.setCursor(14, 14);
  u8g2.printf("%04d.%02d.%02d %d\n", Yea, Mon, Day, Wee);
  u8g2.setCursor(29, 30);
  u8g2.printf("%02d:%02d:%02d\n", Hou, Min, Sec);
  u8g2.sendBuffer();
}
/////////////////////////////////////////

// 主菜单
/////////////////////////////////////////
void menu()
{
  // Switch.pressed = 0;
  // Serial.printf("Menu\n");
  static int a = 0, b = 0, c = 0;
  int d = 1;
  while (d)
  {
    joystick(&a, &b);
    if (a >= 5 || a <= -1)
    {
      a = (a + 5) % 5;
      b += 1;
    }
    b = (b + 2) % 2;
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
    u8g2.drawGlyph(7, 24, menuicons[b][0]);
    u8g2.drawGlyph(30, 24, menuicons[b][1]);
    u8g2.drawGlyph(53, 24, menuicons[b][2]);
    u8g2.drawGlyph(76, 24, menuicons[b][3]);
    u8g2.drawGlyph(99, 24, menuicons[b][4]);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.drawRFrame(4 + 23 * (a % 5), 6, 22, 20, 3);
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", b + 1);
    u8g2.setCursor(117, 8);
    u8g2.printf("%d", a + 1);
    u8g2.sendBuffer();
    c = b * 5 + (a + 1);
    Serial.println(Button.pressed);
    if (Switch.pressed /*joysw() ||button() Button.pressed*/)
    {
      // Serial.println(Button.pressed);
      Switch.pressed = 0;
      Button.pressed = 0;
      switch (c)
      {
      case 1:
        a = b = d = 0;
        break;
      case 2:
        timerset();
        break;
      case 3:
        weather();
        break;
      case 4:
        settings();
        break;
      case 5:
        gps();
        break;
      case 7:
        lab();
        break;
      case 9:
        manager();
        break;
      case 10:
        power();
        break;
      default:
        building();
      }
    }
  }
}
/////////////////////////////////////////

// 设置
/////////////////////////////////////////
void settings()
{
  static int a = 0, b = 0, c = 0;
  int d = 1;
  while (d)
  {
    joystick(&a, &b);
    if (a >= 5 || a <= -1)
    {
      a = (a + 5) % 5;
      // b += 1;
    }
    // b = (b + H_I) % H_I;
    b = 0;
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
    u8g2.drawGlyph(7, 24, settingsicons[0][0]);
    u8g2.drawGlyph(30, 24, settingsicons[0][1]);
    u8g2.drawGlyph(53, 24, settingsicons[0][2]);
    u8g2.drawGlyph(76, 24, settingsicons[0][3]);
    u8g2.drawGlyph(99, 24, settingsicons[0][4]);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.drawRFrame(4 + 23 * (a % 5), 6, 22, 20, 3);
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", b + 1);
    u8g2.setCursor(117, 8);
    u8g2.printf("%d", a + 1);
    u8g2.sendBuffer();
    c = b * 5 + (a + 1);
    if (/*joysw button() Button.pressed*/ Switch.pressed)
    {
      Button.pressed = 0;
      Switch.pressed = 0;
      switch (c)
      {
      case 3:
        clksets();
        break;
      case 4:
        esp_info();
        break;
      case 5:
        a = b = d = 0;
        break;
      case 10:
        power();
        break;
      default:
        building();
      }
    }
    // Serial.printf("%d %d \n", button(), joysw());
  }
}
/////////////////////////////////////////

// 定时器设置
/////////////////////////////////////////
void timerset()
{
  int h = 0, m = 0, s = 0;
  int a = 0, b = 0;
  while (!Button.pressed)
  {
    // joystick(&a, &b);
    u8g2.clearBuffer();
    switch (a)
    {
    case 0:
      joystick(&a, &h);
      h = (h + 100) % 100;
      break;
    case 1:
      joystick(&a, &m);
      m = (m + 60) % 60;
      break;
    case 2:
      joystick(&a, &s);
      s = (s + 60) % 60;
      break;
    default:
      joystick(&a, NULL);
    }
    a = (a + 3) % 3;
    if (a < 2)
    {
      u8g2.drawBox(29 + 23 * a, 4, 17, 4);
      u8g2.drawBox(29 + 23 * a, 22, 17, 4);
    }
    else
      u8g2.drawBox(0, 22, 22, 4);
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(29, 21);
    u8g2.printf("%02d:%02d:%02d", h, m, s);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", a + 1);
    /*u8g2.setCursor(117, 8);
    u8g2.printf("%d", a)
    button()*/
    u8g2.sendBuffer();
    if (/*a == 3 && */ Switch.pressed && !(h == 0 && m == 0 && s == 0))
    {
      Button.pressed = 0;
      Switch.pressed = 0;
      count(h, m, s);
      a++;
    }
    if (reset)
    {
      reset = 0;
      h = m = s = 0;
    }
  }
  Switch.pressed = 0;
  Button.pressed = 0;
}
/////////////////////////////////////////

// 倒计时
/////////////////////////////////////////
int count(int h_c, int m_c, int s_c)
{
  int c = 1, t = 0;
  while (h_c != 0 || m_c != 0 || s_c != 0 && c)
  {
    if (reset)
    {
      return 0;
    }
    if (!(Button.pressed || Switch.pressed))
    {

      Button.pressed = 0;
      Switch.pressed = 0;
      s_c -= 1;
      if (s_c < 0)
      {
        m_c--;
        s_c += 60;
      }
      if (m_c < 0)
      {
        h_c--;
        m_c += 60;
      }
      u8g2.clearBuffer();
      u8g2.setFont(u8g2_font_helvB12_tf);
      u8g2.setCursor(29, 21);
      u8g2.printf("%02d:%02d:%02d", h_c, m_c, s_c);
      u8g2.sendBuffer();
    }
    else
      cpause();
  }
  Button.pressed = 0;
  Switch.pressed = 0;
  if (!reset)
    ring(1);
  return 0;
}
/////////////////////////////////////////

// 计时器暂停
/////////////////////////////////////////
void cpause()
{
  int a = 0, b = 0, c = 1;
  while (c && !reset)
  {
    joystick(NULL, &b);
    b = (b + 2) % 2;
    u8g2.clearBuffer();
    u8g2.drawBox(37, 3 + 15 * b, 11, 11);
    u8g2.drawBox(75, 3 + 15 * b, 11, 11);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.setCursor(50, 13);
    u8g2.printf("继续");
    u8g2.setCursor(50, 28);
    u8g2.printf("重置");
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", b + 1);
    if (Button.pressed)
    {
      Button.pressed =0;
      c = 0;
      reset = 1;
    }
    else if (Switch.pressed)
    {
      Switch.pressed = 0;
      switch (b)
      {
      case 0:
        c = 0;
        break;
      case 1:
        c = 0;
        reset = 1;
        break;
      }
    }
    u8g2.sendBuffer();
  }
}
/////////////////////////////////////////

// 蜂鸣器响铃
/////////////////////////////////////////
void ring(int b)
{
  int i = 0, t = 0, a = 0;
  while (!(Button.pressed || Switch.pressed) && b)
  {

