ESP6109/ESP32Toy/32LCD/src/main(Pre-Segmentation).cpp
    /*analogWrite(33, 255);
    analogWrite(25, 255);*/
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
    u8g2.drawGlyph(53, 24, 93);
    u8g2.sendBuffer();
    if (a < 6)
    {
      if (millis() - t >= 100)
      {
        i = !i;
        digitalWrite(Beep, i);
        digitalWrite(2, i);
        t = millis();
        ++a;
      }
    }
    else if (a >= 6 && a <= 10)
    {
      digitalWrite(Beep, 0);
      digitalWrite(2, 0);
      if (millis() - t >= 100)
      {

        t = millis();
        ++a;
        a %= 10;
      }
    }
    Serial.println(a);
  }
  digitalWrite(Beep, 0);
  digitalWrite(2, 0);
  Button.pressed = 0;
  Switch.pressed = 0;
}
/////////////////////////////////////////

// 天气
//
void weather()
{
  int i = 0;
  //
  while (!Button.pressed)
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_4x_t); // 设定字体
    u8g2.drawGlyph(45, 32, weathericons[i]);
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(0, 14);
    u8g2.printf("-%02d°C", MinT);
    u8g2.setCursor(0, 30);
    u8g2.printf("-%02d°C", MaxT);
    u8g2.setCursor(80, 14);
    u8g2.printf("-%02d°C", Tem);
    u8g2.setCursor(88, 30);
    u8g2.printf("%02d", Hum);
    u8g2.drawUTF8(108, 30, "%");
    u8g2.sendBuffer();
  }
  Switch.pressed = 0;
  Button.pressed = 0;
}
//

// 定位
/////////////////////////////////////////
void gps()
{
  int i = 0;
  int a = 0, b = 0;
  setCpuFrequencyMhz(240);
  while (!Button.pressed)
  {
    while (Serial2.available())
    {
      GPS.encode(Serial2.read());
      // Serial.printf("%c",Serial2.read());
    }
    Serial.printf("\n");
    joystick(&a, &b);
    a = a + 4;
    a %= 4;
    /*while (joysw())
    {
      i++;
      i %= 4;
    }*/
    strcpy(Ava, A.value());
    // digitalWrite(2, 1);
    if (Ava[0] == 'V') // 无效
    {
      digitalWrite(2, 0);
      G_t = 0;
    }
    else if (Ava[0] == 'A') // 有效
    {
      digitalWrite(2, 1);
      G_t = 1;
    }
    gpsget();
    gpsdisplay(a);
  }
  Switch.pressed = 0;
  Button.pressed = 0;
  setCpuFrequencyMhz(80);
  G_t = 0;
  digitalWrite(2, 0);
}
/////////////////////////////////////////

// 卫星数据
/////////////////////////////////////////
void gpsget()
{
  Yea = GPS.date.year();    // 年
  Mon = GPS.date.month();   // 月
  Day = GPS.date.day();     // 日
  Hou = GPS.time.hour();    // 时
  Min = GPS.time.minute();  // 分
  Sec = GPS.time.second();  // 秒
  Lng = GPS.location.lng(); // 经度
  Lat = GPS.location.lat(); // 纬度
  Spe = GPS.speed.kmph();   // 速度
  Cou = GPS.course.deg();   // 方向角
  Hou += 8;
}
/////////////////////////////////////////

// 定位显示
/////////////////////////////////////////
void gpsdisplay(int s)
{
  switch (s)
  {
  case 0:
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(0, 14);
    u8g2.printf("%02d.%02d.%02d  %d  %3d\n", (Yea % 100), Mon, Day, Wee, Spe);
    u8g2.setCursor(0, 30);
    u8g2.printf("%02d:%02d %3d %3d\n", Hou, Min, int(Lat), int(Lng));
    u8g2.sendBuffer();
    break;
  }
  case 1:
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(14, 14);
    u8g2.printf("%4d.%02d.%02d %d\n", Yea, Mon, Day, Wee);
    u8g2.setCursor(29, 30);
    u8g2.printf("%02d:%02d:%02d\n", Hou, Min, Sec);
    u8g2.sendBuffer();
    break;
  }
  case 2:
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(0, 14);
    u8g2.printf("%2d%f\n", (int(Lat) / 10), (Lat - int(Lat) / 10 * 10));
    u8g2.setCursor(100, 14);
    u8g2.printf("%s", NS.value());
    u8g2.setCursor(0, 30);
    u8g2.printf("%2d%f\n", (int(Lng) / 10), (Lng - int(Lng) / 10 * 10));
    u8g2.setCursor(100, 30);
    u8g2.printf("%s", WE.value());
    u8g2.sendBuffer();
    break;
  }
  case 3:
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_helvB12_tf);
    if ((Cou > 338 && Cou < 360) || (Cou >= 0 && Cou < 22)) // N
    {

      u8g2.setCursor(0, 30);
      u8g2.printf("N");
    }
    else if (Cou >= 22 && Cou <= 68) // NE
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("NE");
    }
    else if (Cou > 68 && Cou < 112) // E
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("E");
    }
    else if (Cou >= 112 && Cou <= 158) // SE
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("SE");
    }
    else if (Cou > 158 && Cou < 202) // S
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("S");
    }
    else if (Cou >= 202 && Cou <= 248) // SW
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("SW");
    }
    else if (Cou > 248 && Cou < 292) // W
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("W");
    }
    if (Cou >= 292 && Cou <= 338) // NW
    {
      u8g2.setCursor(0, 30);
      u8g2.printf("NW");
    }
    u8g2.setCursor(0, 14);
    u8g2.printf("%d\n", Cou);
    u8g2.setFont(u8g2_font_logisoso32_tn);
    u8g2.setCursor(64, 32);
    u8g2.printf("%03d\n", Spe);
    u8g2.sendBuffer();
    break;
  }
  }
}
/////////////////////////////////////////

// 测试
/////////////////////////////////////////
void lab()
{
  setCpuFrequencyMhz(240);
  while (!Button.pressed /* || !Switch.pressed !joysw()*/)
  {
    // Switch.pressed = 0;
    // Button.pressed = 0;
    Serial.println(Button.pressed);
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_helvB12_tf);
    u8g2.setCursor(0, 14);
    u8g2.printf("X-%04d", analogRead(X));
    u8g2.setCursor(0, 30);
    u8g2.printf("Y-%04d", analogRead(Y));
    /*u8g2.setCursor(56, 22);
    u8g2.printf("SW-%04d", analogRead(SW));
    u8g2.setCursor(56, 14);
     u8g2.printf("BU-%04d", analogRead(BU));
     u8g2.setCursor(56, 30);
     u8g2.printf("SW-%04d", analogRead(SW));*/
    u8g2.sendBuffer();
    /*if (analogRead(SW) == 0)
      analogWrite(2, 255);
    else
      analogWrite(2, 0);*/
    // Serial.printf("%d,%d\n", analogRead(BU), analogRead(SW));
  }
  Serial.println(Button.pressed);
  Switch.pressed = 0;
  Button.pressed = 0;
  setCpuFrequencyMhz(80);
  // analogWrite(2, 0);
}
/////////////////////////////////////////

// 校时
/////////////////////////////////////////
void clksets()
{
  int a = 0, b = 0;
  while (!Button.pressed)
  {
    joystick(NULL, &b);
    b = (b + 2) % 2;
    u8g2.clearBuffer();
    u8g2.drawBox(37, 3 + 15 * b, 11, 11);
    u8g2.drawBox(75, 3 + 15 * b, 11, 11);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.setCursor(0, 20);
    u8g2.printf("校时");
    u8g2.setCursor(50, 13);
    u8g2.printf("卫星");
    u8g2.setCursor(50, 28);
    u8g2.printf("WIFI");
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", b + 1);
    u8g2.sendBuffer();
  }
  Switch.pressed = 0;
  Button.pressed = 0;
}
/////////////////////////////////////////

