ESP6109/ESP32Toy/32LCD/src/main(Pre-Segmentation).cpp
// 关于
/////////////////////////////////////////
void esp_info()
{
  while (!Button.pressed)
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.setCursor(13, 9);
    u8g2.printf("Built on ESP Tech.");
    u8g2.setCursor(4, 20);
    u8g2.printf("Designed by ESP6109.");
    u8g2.setCursor(25, 31);
    u8g2.printf("Version 3.5.0");
    u8g2.sendBuffer();
  }
  Switch.pressed = 0;
  Button.pressed = 0;
}
/////////////////////////////////////////

// BUILDING
/////////////////////////////////////////
void building()
{
  while (!(/*joysw() || */ Button.pressed))
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
    u8g2.drawGlyph(53, 24, 282);
    u8g2.sendBuffer();
  }
  Switch.pressed = 0;
  Button.pressed = 0;
}
/////////////////////////////////////////

// 管理器
/////////////////////////////////////////
void manager()
{
  /*unsigned int i, j = 0;
  i = millis() / 1000;
  while ((millis() / 1000) - i > 0)
  {
    if (button())
      j = (j + 1) % 2;
    i = millis() / 1000;
    u8g2.clearBuffer();
    // u8g2.setFont(u8g2_font_wqy16_t_gb2312);
    u8g2.setFont(u8g2_font_t0_16_mf);
    u8g2.setCursor(10, 10);
    u8g2.printf("Start Manager");
    u8g2.setCursor(105, 30);
    u8g2.printf("%d", 3 - i);
    u8g2.setCursor(21, 30);
    u8g2.printf("%d", j + 1);
    u8g2.sendBuffer();
    delay(1);
  }
  if (3 - i <= 0)
    switch (j)
    {
    case 0:
      s_box();
      break;
    case 1:
      s_shot();
      break;
    }*/
  s_box();
  s_shot();
  Switch.pressed = 0;
  Button.pressed = 0;
}
/////////////////////////////////////////

// 界面1
/////////////////////////////////////////
void s_box()
{
  int i, j;
  for (i = 1; i <= 7; ++i)
  {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.setCursor(13, 10);
    u8g2.printf("Built on ESP Tech.");
    for (j = -2; j <= i; ++j)
      u8g2.drawBox(-13 + 17 * j, 18, 12, 14);
    u8g2.sendBuffer();
    delay(100);
  }
  clearscr();
}
/////////////////////////////////////////

// 界面2
/////////////////////////////////////////
void s_shot()
{
  clearscr();
  int i = 45, j = 0;
  u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
  u8g2.setFontDirection(0);
  while (i <= 152)
  {
    u8g2.clearBuffer();
    u8g2.setCursor(70, 9);
    u8g2.printf("PENIS");
    u8g2.setCursor(65, 32);
    u8g2.printf("CUMING");
    u8g2.drawDisc(8, 8, 8, U8G2_DRAW_ALL);
    u8g2.drawDisc(8, 23, 8, U8G2_DRAW_ALL);
    u8g2.drawBox(3, 10, 45, 14);
    u8g2.drawFilledEllipse(45, 16, 8, 9);
    u8g2.drawDisc(i, 16, 3, U8G2_DRAW_ALL);
    u8g2.drawDisc(i - 25, 16, 3, U8G2_DRAW_ALL);
    if (i >= 90)
    {
      u8g2.drawDisc(i - 50, 16, 3, U8G2_DRAW_ALL);
      u8g2.drawDisc(i - 75, 16, 3, U8G2_DRAW_ALL);
    }
    i += 2;
    /*if (i == 143)
      i -= 24;
    else
    if (button())
      break;*/
    u8g2.sendBuffer();
  }
  clearscr();
}
/////////////////////////////////////////

// 电源选项
/////////////////////////////////////////
void power()
{
  static int a = 0, b = 0, c = 0;
  int d = 1;
  while (d)
  {
    joystick(&a, &b);
    if (a >= 5 || a <= -1)
    {
      a = (a + 5) % 5;
    }
    // b = (b + H_I) % H_I;
    b = 0;
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
    u8g2.drawGlyph(7, 24, powericons[0][0]);
    u8g2.drawGlyph(30, 24, powericons[0][1]);
    u8g2.drawGlyph(53, 24, powericons[0][2]);
    u8g2.drawGlyph(76, 24, powericons[0][3]);
    u8g2.drawGlyph(99, 24, powericons[0][4]);
    u8g2.setFont(u8g2_font_wqy12_t_gb2312b);
    u8g2.drawRFrame(4 + 23 * (a % 5), 6, 22, 20, 3);
    u8g2.setCursor(0, 8);
    u8g2.printf("%d", b + 1);
    u8g2.setCursor(117, 8);
    u8g2.printf("%d", a + 1);
    u8g2.sendBuffer();
    c = b * 5 + (a + 1);
    if (Switch.pressed)
    {
      Switch.pressed = 0;
      switch (c)
      {
      case 1:
        shutdown();
        break;
      case 2:
        restart();
        break;
      case 3:
        building();
        break;
      case 5:
        a = b = d = 0;
        break;
      default:
        building();
      }
    }
  }
}
/////////////////////////////////////////

// 重置
/////////////////////////////////////////
void restart()
{
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
  u8g2.drawGlyph(53, 24, powericons[0][1]);
  u8g2.sendBuffer();
  delay(750);
  clearscr();
  esp_restart();
}
/////////////////////////////////////////

// 关机
/////////////////////////////////////////
void shutdown()
{
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_open_iconic_all_2x_t);
  u8g2.drawGlyph(53, 24, powericons[0][0]);
  u8g2.sendBuffer();
  delay(750);
  clearscr();
  esp_deep_sleep_start();
}
/////////////////////////////////////////
